Revit 2027 API
RenderingQuality Enumeration
 Indicates the rendering quality in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RenderingQuality
Public Enumeration RenderingQuality
public enum class RenderingQuality
type RenderingQuality
Members
Member name | Value | Description
Custom | 16 |  Custom level quality.
Draft | 11 |  Draft level quality.
High | 14 |  High level quality.
Medium | 13 |  Medium level quality.
VeryHigh | 15 |  Very high level quality.
See Also
Reference
Autodesk.Revit.DB Namespace